ujsi/Hoverboard-ADC-Serial-S.Bus/Hoverboard_ADC_SERIAL_SBUS/System/stm32f1_gpiob.h
// Header..: GPIOB.H
// Version.: 1.0
// Compiler: GCC-ARM
// Chip....: STM32F10x
// Date....: January 2025
// Author..: Udo Juerss
//-----------------------------------------------------------------------------

#pragma once
//-----------------------------------------------------------------------------

#include "stm32f1_gpio_common.h"
//-----------------------------------------------------------------------------

// GPIOB analog inputs
#define GPIOB_0_IN_AN() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_AN_0;}
#define GPIOB_1_IN_AN() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_AN_1;}
#define GPIOB_2_IN_AN() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_AN_2;}
#define GPIOB_3_IN_AN() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_AN_3;}
#define GPIOB_4_IN_AN() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_AN_4;}
#define GPIOB_5_IN_AN() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_AN_5;}
#define GPIOB_6_IN_AN() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_AN_6;}
#define GPIOB_7_IN_AN() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_AN_7;}
#define GPIOB_8_IN_AN() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_AN_0;}
#define GPIOB_9_IN_AN() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_AN_1;}
#define GPIOB_10_IN_AN() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_AN_2;}
#define GPIOB_11_IN_AN() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_AN_3;}
#define GPIOB_12_IN_AN() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_AN_4;}
#define GPIOB_13_IN_AN() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_AN_5;}
#define GPIOB_14_IN_AN() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_AN_6;}
#define GPIOB_15_IN_AN() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_AN_7;}

// GPIOB floating inputs
#define GPIOB_0_IN_FLT() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_FLT_0;}
#define GPIOB_1_IN_FLT() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_FLT_1;}
#define GPIOB_2_IN_FLT() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_FLT_2;}
#define GPIOB_3_IN_FLT() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_FLT_3;}
#define GPIOB_4_IN_FLT() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_FLT_4;}
#define GPIOB_5_IN_FLT() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_FLT_5;}
#define GPIOB_6_IN_FLT() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_FLT_6;}
#define GPIOB_7_IN_FLT() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_FLT_7;}
#define GPIOB_8_IN_FLT() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_FLT_0;}
#define GPIOB_9_IN_FLT() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_FLT_1;}
#define GPIOB_10_IN_FLT() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_FLT_2;}
#define GPIOB_11_IN_FLT() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_FLT_3;}
#define GPIOB_12_IN_FLT() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_FLT_4;}
#define GPIOB_13_IN_FLT() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_FLT_5;}
#define GPIOB_14_IN_FLT() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_FLT_6;}
#define GPIOB_15_IN_FLT() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_FLT_7;}

// GPIOB inputs with pullup enabled
#define GPIOB_0_IN_PU() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_PUD_0; GPIOB_0_SET();}
#define GPIOB_1_IN_PU() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_PUD_1; GPIOB_1_SET();}
#define GPIOB_2_IN_PU() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_PUD_2; GPIOB_2_SET();}
#define GPIOB_3_IN_PU() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_PUD_3; GPIOB_3_SET();}
#define GPIOB_4_IN_PU() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_PUD_4; GPIOB_4_SET();}
#define GPIOB_5_IN_PU() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_PUD_5; GPIOB_5_SET();}
#define GPIOB_6_IN_PU() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_PUD_6; GPIOB_6_SET();}
#define GPIOB_7_IN_PU() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_PUD_7; GPIOB_7_SET();}
#define GPIOB_8_IN_PU() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_PUD_0; GPIOB_8_SET();}
#define GPIOB_9_IN_PU() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_PUD_1; GPIOB_9_SET();}
#define GPIOB_10_IN_PU() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_PUD_2; GPIOB_10_SET();}
#define GPIOB_11_IN_PU() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_PUD_3; GPIOB_11_SET();}
#define GPIOB_12_IN_PU() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_PUD_4; GPIOB_12_SET();}
#define GPIOB_13_IN_PU() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_PUD_5; GPIOB_13_SET();}
#define GPIOB_14_IN_PU() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_PUD_6; GPIOB_14_SET();}
#define GPIOB_15_IN_PU() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_PUD_7; GPIOB_15_SET();}

// GPIOB inputs with pulldown enabled
#define GPIOB_0_IN_PD() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_PUD_0; GPIOB_0_CLR();}
#define GPIOB_1_IN_PD() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_PUD_1; GPIOB_1_CLR();}
#define GPIOB_2_IN_PD() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_PUD_2; GPIOB_2_CLR();}
#define GPIOB_3_IN_PD() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_PUD_3; GPIOB_3_CLR();}
#define GPIOB_4_IN_PD() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_PUD_4; GPIOB_4_CLR();}
#define GPIOB_5_IN_PD() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_PUD_5; GPIOB_5_CLR();}
#define GPIOB_6_IN_PD() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_PUD_6; GPIOB_6_CLR();}
#define GPIOB_7_IN_PD() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_PUD_7; GPIOB_7_CLR();}
#define GPIOB_8_IN_PD() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_PUD_0; GPIOB_8_CLR();}
#define GPIOB_9_IN_PD() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_PUD_1; GPIOB_9_CLR();}
#define GPIOB_10_IN_PD() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_PUD_2; GPIOB_10_CLR();}
#define GPIOB_11_IN_PD() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_PUD_3; GPIOB_11_CLR();}
#define GPIOB_12_IN_PD() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_PUD_4; GPIOB_12_CLR();}
#define GPIOB_13_IN_PD() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_PUD_5; GPIOB_13_CLR();}
#define GPIOB_14_IN_PD() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_PUD_6; GPIOB_14_CLR();}
#define GPIOB_15_IN_PD() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_PUD_7; GPIOB_15_CLR();}

// GPIOB push/pull outputs 2M/10M/50M
#define GPIOB_0_OUT_PP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_PP_0_2M;}
#define GPIOB_0_OUT_PP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_PP_0_10M;}
#define GPIOB_0_OUT_PP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_PP_0_50M;}

#define GPIOB_1_OUT_PP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_PP_1_2M;}
#define GPIOB_1_OUT_PP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_PP_1_10M;}
#define GPIOB_1_OUT_PP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_PP_1_50M;}

#define GPIOB_2_OUT_PP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_PP_2_2M;}
#define GPIOB_2_OUT_PP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_PP_2_10M;}
#define GPIOB_2_OUT_PP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_PP_2_50M;}

#define GPIOB_3_OUT_PP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_PP_3_2M;}
#define GPIOB_3_OUT_PP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_PP_3_10M;}
#define GPIOB_3_OUT_PP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_PP_3_50M;}

