ujsi/Hoverboard-ADC-Serial-S.Bus/Hoverboard_ADC_SERIAL_SBUS/System/stm32f1_gpiob.h
#define GPIOB_4_OUT_PP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_PP_4_2M;}
#define GPIOB_4_OUT_PP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_PP_4_10M;}
#define GPIOB_4_OUT_PP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_PP_4_50M;}

#define GPIOB_5_OUT_PP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_PP_5_2M;}
#define GPIOB_5_OUT_PP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_PP_5_10M;}
#define GPIOB_5_OUT_PP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_PP_5_50M;}

#define GPIOB_6_OUT_PP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_PP_6_2M;}
#define GPIOB_6_OUT_PP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_PP_6_10M;}
#define GPIOB_6_OUT_PP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_PP_6_50M;}

#define GPIOB_7_OUT_PP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_PP_7_2M;}
#define GPIOB_7_OUT_PP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_PP_7_10M;}
#define GPIOB_7_OUT_PP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_PP_7_50M;}

#define GPIOB_8_OUT_PP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_PP_0_2M;}
#define GPIOB_8_OUT_PP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_PP_0_10M;}
#define GPIOB_8_OUT_PP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_PP_0_50M;}

#define GPIOB_9_OUT_PP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_PP_1_2M;}
#define GPIOB_9_OUT_PP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_PP_1_10M;}
#define GPIOB_9_OUT_PP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_PP_1_50M;}

#define GPIOB_10_OUT_PP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_PP_2_2M;}
#define GPIOB_10_OUT_PP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_PP_2_10M;}
#define GPIOB_10_OUT_PP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_PP_2_50M;}

#define GPIOB_11_OUT_PP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_PP_3_2M;}
#define GPIOB_11_OUT_PP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_PP_3_10M;}
#define GPIOB_11_OUT_PP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_PP_3_50M;}

#define GPIOB_12_OUT_PP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_PP_4_2M;}
#define GPIOB_12_OUT_PP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_PP_4_10M;}
#define GPIOB_12_OUT_PP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_PP_4_50M;}

#define GPIOB_13_OUT_PP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_PP_5_2M;}
#define GPIOB_13_OUT_PP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_PP_5_10M;}
#define GPIOB_13_OUT_PP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_PP_5_50M;}

#define GPIOB_14_OUT_PP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_PP_6_2M;}
#define GPIOB_14_OUT_PP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_PP_6_10M;}
#define GPIOB_14_OUT_PP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_PP_6_50M;}

#define GPIOB_15_OUT_PP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_PP_7_2M;}
#define GPIOB_15_OUT_PP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_PP_7_10M;}
#define GPIOB_15_OUT_PP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_PP_7_50M;}

// GPIOB open drain outputs 2M/10M/50M
#define GPIOB_0_OUT_OD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_OD_0_2M;}
#define GPIOB_0_OUT_OD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_OD_0_10M;}
#define GPIOB_0_OUT_OD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_OD_0_50M;}

#define GPIOB_1_OUT_OD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_OD_1_2M;}
#define GPIOB_1_OUT_OD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_OD_1_10M;}
#define GPIOB_1_OUT_OD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_OD_1_50M;}

#define GPIOB_2_OUT_OD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_OD_2_2M;}
#define GPIOB_2_OUT_OD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_OD_2_10M;}
#define GPIOB_2_OUT_OD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_OD_2_50M;}

#define GPIOB_3_OUT_OD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_OD_3_2M;}
#define GPIOB_3_OUT_OD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_OD_3_10M;}
#define GPIOB_3_OUT_OD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_OD_3_50M;}

#define GPIOB_4_OUT_OD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_OD_4_2M;}
#define GPIOB_4_OUT_OD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_OD_4_10M;}
#define GPIOB_4_OUT_OD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_OD_4_50M;}

#define GPIOB_5_OUT_OD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_OD_5_2M;}
#define GPIOB_5_OUT_OD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_OD_5_10M;}
#define GPIOB_5_OUT_OD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_OD_5_50M;}

#define GPIOB_6_OUT_OD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_OD_6_2M;}
#define GPIOB_6_OUT_OD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_OD_6_10M;}
#define GPIOB_6_OUT_OD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_OD_6_50M;}

#define GPIOB_7_OUT_OD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_OD_7_2M;}
#define GPIOB_7_OUT_OD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_OD_7_10M;}
#define GPIOB_7_OUT_OD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_OD_7_50M;}

#define GPIOB_8_OUT_OD_2M() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_OD_0_2M;}
#define GPIOB_8_OUT_OD_10M() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_OD_0_10M;}
#define GPIOB_8_OUT_OD_50M() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_OD_0_50M;}

#define GPIOB_9_OUT_OD_2M() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_OD_1_2M;}
#define GPIOB_9_OUT_OD_10M() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_OD_1_10M;}
#define GPIOB_9_OUT_OD_50M() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_OD_1_50M;}

#define GPIOB_10_OUT_OD_2M() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_OD_2_2M;}
#define GPIOB_10_OUT_OD_10M() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_OD_2_10M;}
#define GPIOB_10_OUT_OD_50M() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_OD_2_50M;}

