ujsi/Hoverboard-ADC-Serial-S.Bus/Hoverboard_ADC_SERIAL_SBUS/System/stm32f1_gpiob.h
#define GPIOB_11_OUT_OD_2M() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_OD_3_2M;}
#define GPIOB_11_OUT_OD_10M() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_OD_3_10M;}
#define GPIOB_11_OUT_OD_50M() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_OD_3_50M;}

#define GPIOB_12_OUT_OD_2M() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_OD_4_2M;}
#define GPIOB_12_OUT_OD_10M() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_OD_4_10M;}
#define GPIOB_12_OUT_OD_50M() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_OD_4_50M;}

#define GPIOB_13_OUT_OD_2M() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_OD_5_2M;}
#define GPIOB_13_OUT_OD_10M() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_OD_5_10M;}
#define GPIOB_13_OUT_OD_50M() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_OD_5_50M;}

#define GPIOB_14_OUT_OD_2M() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_OD_6_2M;}
#define GPIOB_14_OUT_OD_10M() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_OD_6_10M;}
#define GPIOB_14_OUT_OD_50M() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_OD_6_50M;}

#define GPIOB_15_OUT_OD_2M() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_OD_7_2M;}
#define GPIOB_15_OUT_OD_10M() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_OD_7_10M;}
#define GPIOB_15_OUT_OD_50M() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_OD_7_50M;}

// GPIOB alternate function push/pull outputs 2M/10M/50M
#define GPIOB_0_OUT_AFPP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_AFPP_0_2M;}
#define GPIOB_0_OUT_AFPP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_AFPP_0_10M;}
#define GPIOB_0_OUT_AFPP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_AFPP_0_50M;}

#define GPIOB_1_OUT_AFPP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_AFPP_1_2M;}
#define GPIOB_1_OUT_AFPP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_AFPP_1_10M;}
#define GPIOB_1_OUT_AFPP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_AFPP_1_50M;}

#define GPIOB_2_OUT_AFPP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_AFPP_2_2M;}
#define GPIOB_2_OUT_AFPP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_AFPP_2_10M;}
#define GPIOB_2_OUT_AFPP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_AFPP_2_50M;}

#define GPIOB_3_OUT_AFPP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_AFPP_3_2M;}
#define GPIOB_3_OUT_AFPP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_AFPP_3_10M;}
#define GPIOB_3_OUT_AFPP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_AFPP_3_50M;}

#define GPIOB_4_OUT_AFPP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_AFPP_4_2M;}
#define GPIOB_4_OUT_AFPP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_AFPP_4_10M;}
#define GPIOB_4_OUT_AFPP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_4; GPIOB->CRL |= GPIO_MSK_AFPP_4_50M;}

#define GPIOB_5_OUT_AFPP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_AFPP_5_2M;}
#define GPIOB_5_OUT_AFPP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_AFPP_5_10M;}
#define GPIOB_5_OUT_AFPP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_5; GPIOB->CRL |= GPIO_MSK_AFPP_5_50M;}

#define GPIOB_6_OUT_AFPP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_AFPP_6_2M;}
#define GPIOB_6_OUT_AFPP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_AFPP_6_10M;}
#define GPIOB_6_OUT_AFPP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_6; GPIOB->CRL |= GPIO_MSK_AFPP_6_50M;}

#define GPIOB_7_OUT_AFPP_2M() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_AFPP_7_2M;}
#define GPIOB_7_OUT_AFPP_10M() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_AFPP_7_10M;}
#define GPIOB_7_OUT_AFPP_50M() {GPIOB->CRL &= GPIO_MSK_CLR_7; GPIOB->CRL |= GPIO_MSK_AFPP_7_50M;}

#define GPIOB_8_OUT_AFPP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_AFPP_0_2M;}
#define GPIOB_8_OUT_AFPP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_AFPP_0_10M;}
#define GPIOB_8_OUT_AFPP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_0; GPIOB->CRH |= GPIO_MSK_AFPP_0_50M;}

#define GPIOB_9_OUT_AFPP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_AFPP_1_2M;}
#define GPIOB_9_OUT_AFPP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_AFPP_1_10M;}
#define GPIOB_9_OUT_AFPP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_1; GPIOB->CRH |= GPIO_MSK_AFPP_1_50M;}

#define GPIOB_10_OUT_AFPP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_AFPP_2_2M;}
#define GPIOB_10_OUT_AFPP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_AFPP_2_10M;}
#define GPIOB_10_OUT_AFPP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_2; GPIOB->CRH |= GPIO_MSK_AFPP_2_50M;}

#define GPIOB_11_OUT_AFPP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_AFPP_3_2M;}
#define GPIOB_11_OUT_AFPP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_AFPP_3_10M;}
#define GPIOB_11_OUT_AFPP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_3; GPIOB->CRH |= GPIO_MSK_AFPP_3_50M;}

#define GPIOB_12_OUT_AFPP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_AFPP_4_2M;}
#define GPIOB_12_OUT_AFPP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_AFPP_4_10M;}
#define GPIOB_12_OUT_AFPP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_4; GPIOB->CRH |= GPIO_MSK_AFPP_4_50M;}

#define GPIOB_13_OUT_AFPP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_AFPP_5_2M;}
#define GPIOB_13_OUT_AFPP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_AFPP_5_10M;}
#define GPIOB_13_OUT_AFPP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_5; GPIOB->CRH |= GPIO_MSK_AFPP_5_50M;}

#define GPIOB_14_OUT_AFPP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_AFPP_6_2M;}
#define GPIOB_14_OUT_AFPP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_AFPP_6_10M;}
#define GPIOB_14_OUT_AFPP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_6; GPIOB->CRH |= GPIO_MSK_AFPP_6_50M;}

#define GPIOB_15_OUT_AFPP_2M() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_AFPP_7_2M;}
#define GPIOB_15_OUT_AFPP_10M() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_AFPP_7_10M;}
#define GPIOB_15_OUT_AFPP_50M() {GPIOB->CRH &= GPIO_MSK_CLR_7; GPIOB->CRH |= GPIO_MSK_AFPP_7_50M;}

// GPIOB alternate function open drain outputs 2M/10M/50M
#define GPIOB_0_OUT_AFOD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_AFOD_0_2M;}
#define GPIOB_0_OUT_AFOD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_AFOD_0_10M;}
#define GPIOB_0_OUT_AFOD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_0; GPIOB->CRL |= GPIO_MSK_AFOD_0_50M;}

#define GPIOB_1_OUT_AFOD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_AFOD_1_2M;}
#define GPIOB_1_OUT_AFOD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_AFOD_1_10M;}
#define GPIOB_1_OUT_AFOD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_1; GPIOB->CRL |= GPIO_MSK_AFOD_1_50M;}

#define GPIOB_2_OUT_AFOD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_AFOD_2_2M;}
#define GPIOB_2_OUT_AFOD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_AFOD_2_10M;}
#define GPIOB_2_OUT_AFOD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_2; GPIOB->CRL |= GPIO_MSK_AFOD_2_50M;}

#define GPIOB_3_OUT_AFOD_2M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_AFOD_3_2M;}
#define GPIOB_3_OUT_AFOD_10M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_AFOD_3_10M;}
#define GPIOB_3_OUT_AFOD_50M() {GPIOB->CRL &= GPIO_MSK_CLR_3; GPIOB->CRL |= GPIO_MSK_AFOD_3_50M;}

